fio/results/pmem_mmap_d32_new.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=mmap, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=mmap, iodepth=1
...
libpmem-seqread: (g=2): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=mmap, iodepth=1
...
libpmem-seqwrite: (g=3): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=mmap, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
[...]

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=28228: Mon Apr 23 17:53:41 2018
   read: IOPS=8128k, BW=31.0GiB/s (33.3GB/s)(930GiB/30001msec)
    clat (nsec): min=384, max=40021k, avg=3279.59, stdev=116298.81
     lat (nsec): min=408, max=40021k, avg=3353.51, stdev=117562.60
    clat percentiles (nsec):
     |  1.00th=[ 1020],  5.00th=[ 1208], 10.00th=[ 1416], 20.00th=[ 1800],
     | 30.00th=[ 2096], 40.00th=[ 2320], 50.00th=[ 2512], 60.00th=[ 2672],
     | 70.00th=[ 2864], 80.00th=[ 3024], 90.00th=[ 3280], 95.00th=[ 3472],
     | 99.00th=[ 3888], 99.50th=[ 4080], 99.90th=[ 4704], 99.95th=[14784],
     | 99.99th=[17024]
   bw (  KiB/s): min=314308, max=1412902, per=2.13%, avg=693130.02, stdev=193017.17, samples=1888
   iops        : min=78577, max=353225, avg=173282.11, stdev=48254.29, samples=1888
  lat (nsec)   : 500=0.01%, 750=0.13%, 1000=0.65%
  lat (usec)   : 2=25.64%, 4=72.92%, 10=0.58%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=68.10%, sys=6.90%, ctx=17476, majf=0, minf=2465
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=243838269,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=28260: Mon Apr 23 17:53:41 2018
  write: IOPS=7531, BW=29.4MiB/s (30.8MB/s)(883MiB/30004msec)
    clat (usec): min=3061, max=47979, avg=4243.57, stdev=4006.46
     lat (usec): min=3061, max=47979, avg=4243.80, stdev=4006.53
    clat percentiles (usec):
     |  1.00th=[ 3130],  5.00th=[ 3163], 10.00th=[ 3163], 20.00th=[ 3163],
     | 30.00th=[ 3163], 40.00th=[ 3163], 50.00th=[ 3195], 60.00th=[ 3195],
     | 70.00th=[ 3195], 80.00th=[ 3195], 90.00th=[ 3228], 95.00th=[15926],
     | 99.00th=[22414], 99.50th=[25297], 99.90th=[25560], 99.95th=[25822],
     | 99.99th=[29230]
   bw (  KiB/s): min=  307, max= 1184, per=2.25%, avg=677.44, stdev=186.22, samples=1888
   iops        : min=   76, max=  296, avg=168.99, stdev=46.55, samples=1888
  lat (msec)   : 4=92.53%, 10=0.85%, 20=4.77%, 50=1.84%
  cpu          : usr=0.18%, sys=74.68%, ctx=17097, majf=0, minf=226275
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,225978,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=2, jobs=32): err= 0: pid=28292: Mon Apr 23 17:53:41 2018
   read: IOPS=8415k, BW=32.1GiB/s (34.5GB/s)(963GiB/30001msec)
    clat (nsec): min=613, max=40026k, avg=3169.89, stdev=112930.25
     lat (nsec): min=636, max=40026k, avg=3242.10, stdev=114223.93
    clat percentiles (nsec):
     |  1.00th=[ 1012],  5.00th=[ 1192], 10.00th=[ 1384], 20.00th=[ 1752],
     | 30.00th=[ 2024], 40.00th=[ 2256], 50.00th=[ 2448], 60.00th=[ 2608],
     | 70.00th=[ 2768], 80.00th=[ 2928], 90.00th=[ 3184], 95.00th=[ 3376],
     | 99.00th=[ 3792], 99.50th=[ 3952], 99.90th=[ 4640], 99.95th=[15168],
     | 99.99th=[17280]
   bw (  KiB/s): min=266825, max=1401555, per=2.36%, avg=795208.51, stdev=222436.97, samples=1888
   iops        : min=66706, max=350388, avg=198801.73, stdev=55609.23, samples=1888
  lat (nsec)   : 750=0.01%, 1000=0.78%
  lat (usec)   : 2=28.02%, 4=70.75%, 10=0.38%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=67.79%, sys=7.22%, ctx=17078, majf=0, minf=2448
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=252447569,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=3, jobs=32): err= 0: pid=28324: Mon Apr 23 17:53:41 2018
  write: IOPS=7538, BW=29.4MiB/s (30.9MB/s)(884MiB/30004msec)
    clat (usec): min=3029, max=93430, avg=4240.06, stdev=4124.81
     lat (usec): min=3030, max=93430, avg=4240.47, stdev=4125.15
    clat percentiles (usec):
     |  1.00th=[ 3130],  5.00th=[ 3130], 10.00th=[ 3163], 20.00th=[ 3163],
     | 30.00th=[ 3163], 40.00th=[ 3163], 50.00th=[ 3195], 60.00th=[ 3195],
     | 70.00th=[ 3195], 80.00th=[ 3195], 90.00th=[ 3195], 95.00th=[15926],
     | 99.00th=[22414], 99.50th=[25297], 99.90th=[28705], 99.95th=[41681],
     | 99.99th=[51643]
   bw (  KiB/s): min=  192, max= 1272, per=3.12%, avg=941.59, stdev=270.16, samples=1905
   iops        : min=   48, max=  318, avg=235.37, stdev=67.55, samples=1905
  lat (msec)   : 4=92.77%, 10=0.76%, 20=4.57%, 50=1.88%, 100=0.02%
  cpu          : usr=0.17%, sys=74.71%, ctx=16756, majf=0, minf=226513
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,226178,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=31.0GiB/s (33.3GB/s), 31.0GiB/s-31.0GiB/s (33.3GB/s-33.3GB/s), io=930GiB (999GB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=29.4MiB/s (30.8MB/s), 29.4MiB/s-29.4MiB/s (30.8MB/s-30.8MB/s), io=883MiB (926MB), run=30004-30004msec

Run status group 2 (all jobs):
   READ: bw=32.1GiB/s (34.5GB/s), 32.1GiB/s-32.1GiB/s (34.5GB/s-34.5GB/s), io=963GiB (1034GB), run=30001-30001msec

Run status group 3 (all jobs):
  WRITE: bw=29.4MiB/s (30.9MB/s), 29.4MiB/s-29.4MiB/s (30.9MB/s-30.9MB/s), io=884MiB (926MB), run=30004-30004msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%