fio/results/ramdisk_libpmem_d32.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqread: (g=2): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqwrite: (g=3): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
libpmem-randread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
libpmem-randwrite: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
libpmem-seqread: Laying out IO file (1 file / 128MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
libpmem-seqwrite: Laying out IO file (1 file / 128MiB)
[...]

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=5418: Fri Apr 20 18:21:55 2018
   read: IOPS=7866k, BW=30.0GiB/s (32.2GB/s)(900GiB/30001msec)
    clat (nsec): min=105, max=32033k, avg=3381.42, stdev=116127.85
     lat (nsec): min=132, max=32033k, avg=3450.27, stdev=117219.79
    clat percentiles (nsec):
     |  1.00th=[ 1032],  5.00th=[ 1432], 10.00th=[ 1656], 20.00th=[ 1928],
     | 30.00th=[ 2128], 40.00th=[ 2320], 50.00th=[ 2480], 60.00th=[ 2640],
     | 70.00th=[ 2832], 80.00th=[ 3056], 90.00th=[ 3408], 95.00th=[ 3728],
     | 99.00th=[ 4768], 99.50th=[ 5472], 99.90th=[ 8384], 99.95th=[18048],
     | 99.99th=[21120]
   bw (  KiB/s): min=104245, max=1044005, per=2.37%, avg=746487.83, stdev=207356.03, samples=1888
   iops        : min=26061, max=261001, avg=186621.58, stdev=51839.00, samples=1888
  lat (nsec)   : 250=0.09%, 500=0.21%, 750=0.15%, 1000=0.44%
  lat (usec)   : 2=22.05%, 4=74.00%, 10=2.99%, 20=0.06%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=73.86%, sys=1.09%, ctx=18221, majf=0, minf=1048931
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=235984747,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=5452: Fri Apr 20 18:21:55 2018
  write: IOPS=7013k, BW=26.8GiB/s (28.7GB/s)(803GiB/30006msec)
    clat (nsec): min=308, max=40007k, avg=3923.62, stdev=124837.86
     lat (nsec): min=339, max=40007k, avg=3985.89, stdev=125890.56
    clat percentiles (nsec):
     |  1.00th=[  916],  5.00th=[ 1480], 10.00th=[ 1752], 20.00th=[ 2096],
     | 30.00th=[ 2352], 40.00th=[ 2608], 50.00th=[ 2832], 60.00th=[ 3088],
     | 70.00th=[ 3376], 80.00th=[ 3696], 90.00th=[ 4256], 95.00th=[ 4832],
     | 99.00th=[ 6112], 99.50th=[ 6688], 99.90th=[ 7968], 99.95th=[ 8512],
     | 99.99th=[10688]
   bw (  KiB/s): min=71413, max=1078371, per=2.68%, avg=751853.06, stdev=210854.28, samples=1888
   iops        : min=17853, max=269592, avg=187962.88, stdev=52713.55, samples=1888
  lat (nsec)   : 500=0.05%, 750=0.43%, 1000=0.82%
  lat (usec)   : 2=15.54%, 4=69.41%, 10=13.73%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=74.17%, sys=0.66%, ctx=18030, majf=0, minf=1048899
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,210437265,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=2, jobs=32): err= 0: pid=5484: Fri Apr 20 18:21:55 2018
   read: IOPS=4385k, BW=16.7GiB/s (17.0GB/s)(504GiB/30113msec)
    clat (nsec): min=242, max=275153, avg=722.83, stdev=391.72
     lat (nsec): min=290, max=275202, avg=775.08, stdev=401.69
    clat percentiles (nsec):
     |  1.00th=[  430],  5.00th=[  478], 10.00th=[  510], 20.00th=[  556],
     | 30.00th=[  588], 40.00th=[  620], 50.00th=[  652], 60.00th=[  700],
     | 70.00th=[  764], 80.00th=[  852], 90.00th=[  980], 95.00th=[ 1096],
     | 99.00th=[ 1608], 99.50th=[ 2448], 99.90th=[ 3376], 99.95th=[ 4128],
     | 99.99th=[14528]
   bw (  KiB/s): min=231575, max=702171, per=2.79%, avg=489219.97, stdev=76748.97, samples=1905
   iops        : min=57893, max=175542, avg=122304.49, stdev=19187.28, samples=1905
  lat (nsec)   : 250=0.01%, 500=8.03%, 750=60.00%, 1000=23.21%
  lat (usec)   : 2=7.94%, 4=0.77%, 10=0.02%, 20=0.03%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=16.43%, sys=5.43%, ctx=15439, majf=0, minf=1048853
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=132040319,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=3, jobs=32): err= 0: pid=5517: Fri Apr 20 18:21:55 2018
  write: IOPS=4442k, BW=16.9GiB/s (18.2GB/s)(511GiB/30134msec)
    clat (nsec): min=271, max=142850, avg=613.98, stdev=318.97
     lat (nsec): min=296, max=142893, avg=666.29, stdev=330.87
    clat percentiles (nsec):
     |  1.00th=[  318],  5.00th=[  330], 10.00th=[  362], 20.00th=[  398],
     | 30.00th=[  474], 40.00th=[  532], 50.00th=[  564], 60.00th=[  604],
     | 70.00th=[  652], 80.00th=[  700], 90.00th=[  884], 95.00th=[ 1144],
     | 99.00th=[ 1784], 99.50th=[ 2024], 99.90th=[ 2672], 99.95th=[ 3088],
     | 99.99th=[ 7328]
   bw (  KiB/s): min=247056, max=981872, per=3.14%, avg=557350.01, stdev=94549.93, samples=1912
   iops        : min=61764, max=245468, avg=139337.47, stdev=23637.49, samples=1912
  lat (nsec)   : 500=33.34%, 750=50.55%, 1000=9.03%
  lat (usec)   : 2=6.55%, 4=0.51%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=18.81%, sys=5.29%, ctx=15748, majf=0, minf=1048898
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,133847166,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=30.0GiB/s (32.2GB/s), 30.0GiB/s-30.0GiB/s (32.2GB/s-32.2GB/s), io=900GiB (967GB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=26.8GiB/s (28.7GB/s), 26.8GiB/s-26.8GiB/s (28.7GB/s-28.7GB/s), io=803GiB (862GB), run=30006-30006msec

Run status group 2 (all jobs):
   READ: bw=16.7GiB/s (17.0GB/s), 16.7GiB/s-16.7GiB/s (17.0GB/s-17.0GB/s), io=504GiB (541GB), run=30113-30113msec

Run status group 3 (all jobs):
  WRITE: bw=16.9GiB/s (18.2GB/s), 16.9GiB/s-16.9GiB/s (18.2GB/s-18.2GB/s), io=511GiB (548GB), run=30134-30134msec